app/controllers/api/v1/devise/registrations_controller.rb

  def create
    resource = User.new sign_up_params
    if resource.save
---
INSERT INTO "users" ("email", "first_name", "last_name", "encrypted_password", "created_at", "updated_at", "confirmation_token", "confirmation_sent_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"