app/controllers/appointments_controller.rb

INSERT INTO "appointments" ("first_name", "last_name", "email", "date_of_visit", "reason_of_visit", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
  	@appointment = Appointment.new(appointment_params)
  	if @appointment.save

SELECT "appointments".* FROM "appointments"  ORDER BY created_at DESC
---
  def set_appointment
  	@appointment = Appointment.find_by(id: params[:id])
    redirect_to appointments_path if @appointment.blank?