app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions"  ORDER BY created_at DESC
---
  def set_question
    @question = Question.find_by(id: params[:id])
    redirect_to questions_path if @question.blank?