app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
SELECT "users".* FROM "users"  ORDER BY created_at DESC
---
  def set_user
    @user = User.find_by(id: params[:id])
    if @user.blank?